# RebarElementRounding Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RebarElementRounding Property
ParameterTypeId Class See Also
---
"Rounding Overrides"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RebarElementRounding { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RebarElementRounding As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RebarElementRounding {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace